Repository: yuki-kimoto/mojolicious-guides-japanese
Catalog: Mojo-OmegaT-omegat.tmx
Source language: en
Languages: ja

source: Construct a new L<Mojolicious::Routes::Pattern> object and L</"parse"> pattern if necessary.
ja: Construct a new [[Mojolicious::Routes::Pattern]] object and [[/"parse"]] pattern if necessary.

source: Construct a new L<Mojolicious::Validator> object.
ja: Construct a new [[Mojolicious::Validator]] object.

source: Construct a new L<Mojolicious> application and call L</"startup">.
ja: Construct a new [[Mojolicious]] application and call [[/"startup"]].

source: Construct a new L<Test::Mojo> object.
ja: Construct a new [[Test::Mojo]] object.

source: Construct a new array-based L<Mojo::Collection> object.
ja: Construct a new array-based [[Mojo::Collection]] object.

source: Construct a new scalar-based L<Mojo::ByteStream> object.
ja: Construct a new scalar-based [[Mojo::ByteStream]] object.

source: Construct a new scalar-based L<Mojo::DOM> object and L</"parse"> HTML/XML fragment if necessary.
ja: Construct a new scalar-based [[Mojo::DOM]] object and [[/"parse"]] HTML/XML fragment if necessary.

source: Construct a new scalar-based L<Mojo::File> object for a temporary directory with L<File::Temp>.
ja: Construct a new scalar-based [[Mojo::File]] object for a temporary directory with [[File::Temp]].

source: Construct a new scalar-based L<Mojo::File> object for a temporary file with L<File::Temp>.
ja: Construct a new scalar-based [[Mojo::File]] object for a temporary file with [[File::Temp]].

source: Construct a new scalar-based L<Mojo::File> object, defaults to using the current working directory.
ja: Construct a new scalar-based [[Mojo::File]] object, defaults to using the current working directory.

source: Content generators can be registered with L<Mojo::UserAgent::Transactor/"add_generator"> to generate the same type of content repeatedly for multiple requests.
ja: Content generators can be registered with [[Mojo::UserAgent::Transactor/"add_generator"]] to generate the same type of content repeatedly for multiple requests.

source: Content headers, defaults to a L<Mojo::Headers> object.
ja: Content headers, defaults to a [[Mojo::Headers]] object.

source: Content negotiation with C<Range>, C<If-None-Match> and C<If-Modified-Since> headers is supported as well and can be tested very easily with L<Mojolicious::Command::get>.
ja: C<Range>、C<If-None-Match>、C<If-Modified-Since>ヘッダー によるコンテンツネゴシエーションにも対応していて、 [[Mojolicious::Command::get]]で簡単にテストできます。

source: Content parts embedded in this multipart content, usually L<Mojo::Content::Single> objects.
ja: Content parts embedded in this multipart content, usually [[Mojo::Content::Single]] objects.

source: Continue dispatch chain and emit the hook L<Mojolicious/"around_action"> for every action.
ja: Continue dispatch chain and emit the hook [[Mojolicious/"around_action"]] for every action.

source: Continue dispatch chain from an intermediate destination with L<Mojolicious::Routes/"continue">.
ja: Continue dispatch chain from an intermediate destination with [[Mojolicious::Routes/"continue"]].

source: Convert asset to L<Mojo::Asset::File> object.
ja: Convert asset to [[Mojo::Asset::File]] object.

source: Cookie jar to use for requests performed by this user agent, defaults to a L<Mojo::UserAgent::CookieJar> object.
ja: Cookie jar to use for requests performed by this user agent, defaults to a [[Mojo::UserAgent::CookieJar]] object.

source: Cookie-based sessions just work out of the box, as soon as you start using them through the helper L<Mojolicious::Plugin::DefaultHelpers/"session">.
ja: [[Mojolicious::Plugin::DefaultHelpers]]のC<session>ヘルパーを使うとすぐに、クッキーをベースとしたセッションが機能します。

source: Cooking with L<Mojolicious>, recipes for every taste.
ja: Cooking with [[Mojolicious]], recipes for every taste.

source: Copy file with L<File::Copy> and return the destination as a L<Mojo::File> object.
ja: Copy file with [[File::Copy]] and return the destination as a [[Mojo::File]] object.

source: Create a new L<Mojo::Promise> object with a timeout or attach a timeout to an existing promise.
ja: Create a new [[Mojo::Promise]] object with a timeout or attach a timeout to an existing promise.

source: Create a new class with one or more L<Role::Tiny> roles.
ja: Create a new class with one or more [[Role::Tiny]] roles.

source: Create attributes for hash-based objects, just like the L</"attr"> method.
ja: Create attributes for hash-based objects, just like the [[/"attr"]] method.

source: Create named timestamp for L<"timing-E<gt>elapsed">.
ja: Create named timestamp for [["timing-E<gt]]elapsed"]].

source: Create the directories if they don't already exist, any additional arguments are passed through to L<File::Path>.
ja: Create the directories if they don't already exist, any additional arguments are passed through to [[File::Path]].

source: Current position on the L</"stack">, defaults to C<0>.
ja: Current position on the [[/"stack"]], defaults to C<0>.

source: Current transaction, usually a L<Mojo::Transaction::HTTP> or L<Mojo::Transaction::WebSocket> object.
ja: Current transaction, usually a [[Mojo::Transaction::HTTP]] or [[Mojo::Transaction::WebSocket]] object.

source: Data storage persistent only for the next request, stored in the L</"session">.
ja: Data storage persistent only for the next request, stored in the [[/"session"]].

source: Decamelize bytestream with L<Mojo::Util/"decamelize">.
ja: Decamelize bytestream with [[Mojo::Util/"decamelize"]].

source: Decode JSON message body directly using L<Mojo::JSON> if possible, an C<undef> return value indicates a bare C<null> or that decoding failed.
ja: Decode JSON message body directly using [[Mojo::JSON]] if possible, an C<undef> return value indicates a bare C<null> or that decoding failed.

source: Decode bytes to characters with L<Encode>, or return C<undef> if decoding failed.
ja: Decode bytes to characters with [[Encode]], or return C<undef> if decoding failed.

source: Decode bytestream with L<Mojo::Util/"decode">, defaults to using C<UTF-8>.
ja: Decode bytestream with [[Mojo::Util/"decode"]], defaults to using C<UTF-8>.

source: Decode percent encoded characters in bytestream with L<Mojo::Util/"url_unescape">.
ja: Decode percent encoded characters in bytestream with [[Mojo::Util/"url_unescape"]].

source: Decode percent encoded characters in string as described in L<RFC 3986|http://tools.ietf.org/html/rfc3986>.
ja: Decode percent encoded characters in string as described in [[RFC 3986|http://tools.ietf.org/html/rfc3986]].

source: Decompress content automatically if L</"is_compressed"> is true.
ja: Decompress content automatically if [[/"is_compressed"]] is true.

source: Default charset used by L</"text"> and to extract data from C<application/x-www-form-urlencoded> or C<multipart/form-data> message body, defaults to C<UTF-8>.
ja: Default charset used by [[/"text"]] and to extract data from C<application/x-www-form-urlencoded> or C<multipart/form-data> message body, defaults to C<UTF-8>.

source: Default exception handling with L<Mojolicious::Plugin::DefaultHelpers/"reply-E<gt>exception"> is the first hook in the chain and a call to L</"dispatch"> the last, yours will be in between.
ja: Default exception handling with [[Mojolicious::Plugin::DefaultHelpers/"reply-E<gt]]exception"]] is the first hook in the chain and a call to [[/"dispatch"]] the last, yours will be in between.

source: Default values for L<Mojolicious::Controller/"stash">, assigned for every new request.
ja: Default values for [[Mojolicious::Controller/"stash"]], assigned for every new request.

source: Default values that don't belong to a placeholder simply get merged into the stash all the time.
ja: プレースホルダーに所属しないデフォルト値は、 いつでも単純にスタッシュにマージされます。

source: Delete L</"path"> automatically once the file is not used anymore.
ja: Delete [[/"path"]] automatically once the file is not used anymore.

source: Delete L</"pid_file"> automatically once it is not needed anymore, defaults to a true value.
ja: Delete [[/"pid_file"]] automatically once it is not needed anymore, defaults to a true value.

source: Delete this directory and any files and subdirectories it may contain, any additional arguments are passed through to L<File::Path>.
ja: Delete this directory and any files and subdirectories it may contain, any additional arguments are passed through to [[File::Path]].

source: Detect MIME type for L<Mojolicious::Controller> object unless a C<Content-Type> response header has already been set, defaults to using the MIME type for the C<txt> extension if no better alternative could be found.
ja: Detect MIME type for [[Mojolicious::Controller]] object unless a C<Content-Type> response header has already been set, defaults to using the MIME type for the C<txt> extension if no better alternative could be found.

source: Detect and load the best reactor implementation available, will try the value of the C<MOJO_REACTOR> environment variable, L<Mojo::Reactor::EV> or L<Mojo::Reactor::Poll>.
ja: Detect and load the best reactor implementation available, will try the value of the C<MOJO_REACTOR> environment variable, [[Mojo::Reactor::EV> or [[Mojo::Reactor::Poll]].

source: Does nothing but return the invocant, since we already have a L<Mojo::Asset::File> object.
ja: Does nothing but return the invocant, since we already have a [[Mojo::Asset::File]] object.

source: Does the same as L</"url_for">, but inherits query parameters from the current request.
ja: Does the same as [[/"url_for"]], but inherits query parameters from the current request.

source: Due to the flexibility of L<Mojolicious> there are many variations of the actual growing process, but this should give you a good overview of the possibilities.
ja: Due to the flexibility of [[Mojolicious]] there are many variations of the actual growing process, but this should give you a good overview of the possibilities.

source: Dump a Perl data structure with L<Data::Dumper>.
ja: Dump a Perl data structure with [[Data::Dumper]].

source: Dump a Perl data structure with L<Mojo::Util/"dumper">, very useful for debugging.
ja: Dump a Perl data structure with [[Mojo::Util/"dumper"]], very useful for debugging.

source: During development you will encounter these pages whenever you make a mistake, they are gorgeous and contain a lot of valuable information that will aid you in debugging your application.
ja: 開発中、間違いを犯したときはいつでも、 このページに遭遇するでしょう。ここには、素晴らしい、アプリケーションのデバックに役立つ 情報がたくさん含まれています。

source: During startup your application is preloaded in the manager process, which does not run an event loop, so you can use L<Mojo::IOLoop/"next_tick"> to run code whenever a new worker process has been forked and its event loop gets started.
ja: During startup your application is preloaded in the manager process, which does not run an event loop, so you can use [[Mojo::IOLoop/"next_tick"]] to run code whenever a new worker process has been forked and its event loop gets started.

source: Each representation can be handled with a callback or a hash reference containing arguments to be passed to L<Mojolicious::Controller/"render">.
ja: Each representation can be handled with a callback or a hash reference containing arguments to be passed to [[Mojolicious::Controller/"render"]].

source: Emit L</"message"> event and log C<debug> message.
ja: Emit [[/"message"]] event and log C<debug> message.

source: Emit L</"message"> event and log C<error> message.
ja: Emit [[/"message"]] event and log C<error> message.

source: Emit L</"message"> event and log C<fatal> message.
ja: Emit [[/"message"]] event and log C<fatal> message.

source: Emit L</"message"> event and log C<info> message.
ja: Emit [[/"message"]] event and log C<info> message.

source: Emit L</"message"> event and log C<warn> message.
ja: Emit [[/"message"]] event and log C<warn> message.

source: Emits the L</"before_server_start"> hook.
ja: Emits the [[/"before_server_start"]] hook.

source: Emitted in the parent process when the subprocess calls the L<progress|/"progress1"> method.
ja: Emitted in the parent process when the subprocess calls the [[progress|/"progress1"]] method.

source: Emitted right before the application server is started, for web servers that support it, which includes all the built-in ones (except for L<Mojo::Server::CGI>).
ja: Emitted right before the application server is started, for web servers that support it, which includes all the built-in ones (except for [[Mojo::Server::CGI]]).

source: Emitted when a new L<Mojo::Content::Single> part starts.
ja: Emitted when a new [[Mojo::Content::Single]] part starts.

source: Emitted when asset gets upgraded to a L<Mojo::Asset::File> object.
ja: Emitted when asset gets upgraded to a [[Mojo::Asset::File]] object.

source: Emitted when content gets upgraded to a L<Mojo::Content::MultiPart> object.
ja: Emitted when content gets upgraded to a [[Mojo::Content::MultiPart]] object.

source: Enable context information for L</"to_string">.
ja: Enable context information for [[/"to_string"]].

source: Encode bytestream with L<Mojo::Util/"encode">, defaults to using C<UTF-8>.
ja: Encode bytestream with [[Mojo::Util/"encode"]], defaults to using C<UTF-8>.

source: Encode characters to bytes with L<Encode>.
ja: Encode characters to bytes with [[Encode]].

source: Ensure L</"pid_file"> exists.
ja: Ensure [[/"pid_file"]] exists.

source: Escape POSIX control characters in bytestream with L<Mojo::Util/"term_escape">.
ja: Escape POSIX control characters in bytestream with [[Mojo::Util/"term_escape"]].

source: Escape only the characters C<&>, C<E<lt>>, C<E<gt>>, C<"> and C<'> in bytestream with L<Mojo::Util/"xml_escape">.
ja: Escape only the characters C<&>, C<E<lt>>, C<E<gt>>, C<"> and C<'> in bytestream with [[Mojo::Util/"xml_escape"]].

source: Escape unsafe characters C<&>, C<E<lt>>, C<E<gt>>, C<"> and C<'> in string, but do not escape L<Mojo::ByteStream> objects.
ja: Escape unsafe characters C<&>, C<E<lt>>, C<E<gt>>, C<"> and C<'> in string, but do not escape [[Mojo::ByteStream]] objects.

source: Escaping behavior can be reversed with the L</"auto_escape"> attribute, this is the default in L<Mojolicious> C<.ep> templates, for example.
ja: Escaping behavior can be reversed with the [[/"auto_escape"]] attribute, this is the default in [[Mojolicious]] C<.ep> templates, for example.

source: Especially for people new to Perl it should be as easy as possible to install L<Mojolicious> and get started.
ja: Especially for people new to Perl it should be as easy as possible to install [[Mojolicious]] and get started.

source: Especially for rearranging routes created by plugins this can be very useful, to find routes by their name you can use L<Mojolicious::Routes::Route/"find">.
ja: Especially for rearranging routes created by plugins this can be very useful, to find routes by their name you can use [[Mojolicious::Routes::Route/"find"]].

source: Especially in combination with L<Mojo::JSON> and L<Mojo::DOM> this can be a very powerful tool.
ja: 特に[[Mojo::JSON]]と[[Mojo::DOM]]の組み合わせはとても強力なツールになります。

source: Essentials every L<Mojolicious> developer should know.
ja: Essentials every [[Mojolicious]] developer should know.

source: Even the route pattern and destination can still be changed with L<Mojolicious::Routes::Pattern/"parse"> and L<Mojolicious::Routes::Pattern/"defaults">.
ja: Even the route pattern and destination can still be changed with [[Mojolicious::Routes::Pattern/"parse"]] and [[Mojolicious::Routes::Pattern/"defaults"]].

source: Event loop object to control, defaults to the global L<Mojo::IOLoop> singleton.
ja: Event loop object to control, defaults to the global [[Mojo::IOLoop]] singleton.

source: Event loop object to use for I/O operations, defaults to the global L<Mojo::IOLoop> singleton.
ja: Event loop object to use for I/O operations, defaults to the global [[Mojo::IOLoop]] singleton.

source: Event loop object to use for blocking I/O operations, defaults to a L<Mojo::IOLoop> object.
ja: Event loop object to use for blocking I/O operations, defaults to a [[Mojo::IOLoop]] object.

source: EventSource is a special form of long polling where you can use L<Mojolicious::Controller/"write"> to directly send DOM events from servers to clients.
ja: EventSource is a special form of long polling where you can use [[Mojolicious::Controller/"write"]] to directly send DOM events from servers to clients.

source: Ever thought about releasing your L<Mojolicious> application to CPAN?
ja: Ever thought about releasing your [[Mojolicious]] application to CPAN?

source: Ever thought about running a quick one-liner against your L<Mojolicious> application to test something?
ja: Ever thought about running a quick one-liner against your [[Mojolicious]] application to test something?

source: Every check is performed right away, so you can use the results immediately to build more advanced validation logic with methods like L<Mojolicious::Validator::Validation/"is_valid">.
ja: Every check is performed right away, so you can use the results immediately to build more advanced validation logic with methods like [[Mojolicious::Validator::Validation/"is_valid"]].

source: Every major release of L<Mojolicious> has a code name, these are the ones that have been used in the past.
ja: Every major release of [[Mojolicious]] has a code name, these are the ones that have been used in the past.

source: Execute callback if the value of L</"success"> is false.
ja: Execute callback if the value of [[/"success"]] is false.

source: Execute the first callback in a child process and wait for it to return one or more values, without blocking L</"ioloop"> in the parent process.
ja: Execute the first callback in a child process and wait for it to return one or more values, without blocking [[/"ioloop"]] in the parent process.

source: Extend L<Mojolicious> with hooks, which allow code to be shared with all requests indiscriminately, for a full list of available hooks see L</"HOOKS">.
ja: Extend [[Mojolicious]] with hooks, which allow code to be shared with all requests indiscriminately, for a full list of available hooks see [[/"HOOKS"]].

source: External static files are not limited to a single file extension and will be served automatically from a C<public> directory if it exists.
ja: 外部に置いた静的ファイルは、拡張子が1種類に制限されず、C<public>ディレクトリが存在すればそこから自動的にサーブされます。

source: External templates will be searched by the renderer in a C<templates> directory if it exists.
ja: 外部テンプレートは、レンダラによってC<templates> ディレクトリから検索されます。

source: Extract options from an array reference with L<Getopt::Long>, but without changing its global configuration, defaults to using C<@ARGV>.
ja: Extract options from an array reference with [[Getopt::Long]], but without changing its global configuration, defaults to using C<@ARGV>.

source: Extract usage message from the SYNOPSIS section of the file this method was called from with L<Mojo::Util/"extract_usage">.
ja: Extract usage message from the SYNOPSIS section of the file this method was called from with [[Mojo::Util/"extract_usage"]].

source: Extract value from L</"data"> identified by the given JSON Pointer.
ja: Extract value from [[/"data"]] identified by the given JSON Pointer.

source: False, this is not a L<Mojo::Asset::File> object.
ja: False, this is not a [[Mojo::Asset::File]] object.

source: False, this is not a L<Mojo::Content::MultiPart> object.
ja: False, this is not a [[Mojo::Content::MultiPart]] object.

source: False, this is not a L<Mojo::Transaction::WebSocket> object.
ja: False, this is not a [[Mojo::Transaction::WebSocket]] object.

source: File path used to create L</"handle">.
ja: File path used to create [[/"handle"]].

source: Filehandle, created on demand for L</"path">, which can be generated automatically and safely based on L</"tmpdir">.
ja: Filehandle, created on demand for [[/"path"]], which can be generated automatically and safely based on [[/"tmpdir"]].

source: Finalize dynamically generated response content and L</"compress"> it if possible.
ja: Finalize dynamically generated response content and [[/"compress"]] it if possible.

source: Finalize response and emit hook L<Mojolicious/"after_dispatch">, defaults to using a C<200> response code.
ja: Finalize response and emit hook [[Mojolicious/"after_dispatch"]], defaults to using a C<200> response code.

source: Find L<Mojo::Cookie::Request> objects in the jar for L<Mojo::URL> object.
ja: Find [[Mojo::Cookie::Request]] objects in the jar for [[Mojo::URL]] object.

source: Find all ancestor elements of this node matching the CSS selector and return a L<Mojo::Collection> object containing these elements as L<Mojo::DOM> objects.
ja: Find all ancestor elements of this node matching the CSS selector and return a [[Mojo::Collection]] object containing these elements as [[Mojo::DOM]] objects.

source: Find all child elements of this element matching the CSS selector and return a L<Mojo::Collection> object containing these elements as L<Mojo::DOM> objects.
ja: Find all child elements of this element matching the CSS selector and return a [[Mojo::Collection]] object containing these elements as [[Mojo::DOM]] objects.

source: Find all descendant elements of this element matching the CSS selector and return a L<Mojo::Collection> object containing these elements as L<Mojo::DOM> objects.
ja: Find all descendant elements of this element matching the CSS selector and return a [[Mojo::Collection]] object containing these elements as [[Mojo::DOM]] objects.

source: Find all sibling elements after this node matching the CSS selector and return a L<Mojo::Collection> object containing these elements as L<Mojo::DOM> objects.
ja: Find all sibling elements after this node matching the CSS selector and return a [[Mojo::Collection]] object containing these elements as [[Mojo::DOM]] objects.

source: Find all sibling elements before this node matching the CSS selector and return a L<Mojo::Collection> object containing these elements as L<Mojo::DOM> objects.
ja: Find all sibling elements before this node matching the CSS selector and return a [[Mojo::Collection]] object containing these elements as [[Mojo::DOM]] objects.

source: Find first descendant element of this element matching the CSS selector and return it as a L<Mojo::DOM> object, or C<undef> if none could be found.
ja: Find first descendant element of this element matching the CSS selector and return it as a [[Mojo::DOM]] object, or C<undef> if none could be found.

source: Find route by name with L<Mojolicious::Routes::Route/"find"> and cache all results for future lookups.
ja: Find route by name with [[Mojolicious::Routes::Route/"find"]] and cache all results for future lookups.

source: First of all, make sure you are using the latest version of L<Mojolicious>, it is quite likely that your bug has already been fixed.
ja: First of all, make sure you are using the latest version of [[Mojolicious]], it is quite likely that your bug has already been fixed.

source: First of all, you need to be aware that according to the L<perlpolicy>, only the two most recent stable release series of Perl are supported by the community and receive bug fixes, which are currently 5.28.x and 5.26.x.
ja: First of all, you need to be aware that according to the [[perlpolicy]], only the two most recent stable release series of Perl are supported by the community and receive bug fixes, which are currently 5.28.x and 5.26.x.

source: For a full list of helpers that are available by default see L<Mojolicious::Plugin::DefaultHelpers> and L<Mojolicious::Plugin::TagHelpers>.
ja: For a full list of helpers that are available by default see [[Mojolicious::Plugin::DefaultHelpers]] and [[Mojolicious::Plugin::TagHelpers]].
